#include <iostream>

using namespace std;

int main() {

  int n;
  cin >> n;

  for (int i = n / 5; i >= 0; i--) {
    if ((n - i * 5) == 0) {
      cout << i;
      return 0;
    } else {
      for (int j = (n - i * 5) / 3; j >= 0; j--) {
        if ((n - i * 5) - j * 3 == 0) {
          cout << i + j;
          return 0;
        }
      }
    }
  }
  cout << -1;
  return 0;
}

/*
N킬로그램 배달, 봉지에 담겨있다, 3킬로,5킬로 봉지가 있다
최대한 적은 봉지로
18 = 5*3 + 3
N킬로 배달해야할때, 봉지를 몇개가져가야될까

18/5=3
18%3 = 3
if3%3==0
3/3 =1
=> 3+1 = 4

4/5=0
4%5=4
if(4%3!=0)
=> -1

6/5=1
6%5=1;
if(1%3!=0)
if(6%3==0)
6/3=2;

if(9%5!=0)
9/5=1;
9%5=4
if(4%3!=0)
cout << -1;

if(11%5==0){
    cout << 11/5;
}
if(11%5!=0){
    11/5=2;
    11%5=1;
    if(2%3==0){
        2/3 = 0;
        cout << 0 + 2+1;
    }
    11-(5*1) = 6;
    if()
}
*/